notes/plan.org

* План доклада
** DONE Титульник
   Зачитать название темы
** TODO Исходная информационная система
*** Про то как это происходит
*** Ролевая и математическая составляющие
** TODO Цели и задачи
*** Цели
*** Задачи
** TODO Используемые технологии
   *ВАЖНО* Технологии были /выбраны/ в соответствии с требованиями.
*** Ruby и Rails
    Для разработки бекенда приложения были использованы ЯВУ Ruby и веб-фреймворк Ruby On Rails
*** Angular
    Для разработки интерактивного редактора персонажей был использован javascript-фреймворк Angular, так как он позволяет быстро и просто создавать интерактивные страницы.
*** Postgresql
    В качестве СУБД данных была выбрана СУБД PostgreSQL
*** Gnu/Linux
    Ну тут без комментариев
*** Git и Bitbucket
    Про контроль версий
*** /Virtualbox и Vagrant?/
*** /LaTeX?/
*** /Emacs?/
** TODO Схема взаимодействия модулей системы
** TODO Логическая модель данных
** TODO Алгоритм вычисления очков умений
   *ВАЖНО* алгоритм *НЕ ТРИВИАЛЬНЫЙ!*
** TODO Редактор персонажей
** DONE Тестирование
   Просто про тестирование
   
