notes/plan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>plan</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="plan"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-06-03T14:04+0400"/>
<meta name="author" content="Emperor"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">plan</h1>


<div id="table-of-contents">
<h1>Table of Contents</h1>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 План доклада</a>
<ul>
<li><a href="#sec-1-1">1.1 Титульник</a></li>
<li><a href="#sec-1-2">1.2 Исходная информационная система</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Про то как это происходит</a></li>
<li><a href="#sec-1-2-2">1.2.2 Ролевая и математическая составляющие</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 Цели и задачи</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 Цели</a></li>
<li><a href="#sec-1-3-2">1.3.2 Задачи</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 Используемые технологии</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 Ruby и Rails</a></li>
<li><a href="#sec-1-4-2">1.4.2 Angular</a></li>
<li><a href="#sec-1-4-3">1.4.3 Postgresql</a></li>
<li><a href="#sec-1-4-4">1.4.4 Gnu/Linux</a></li>
<li><a href="#sec-1-4-5">1.4.5 Git и Bitbucket</a></li>
<li><a href="#sec-1-4-6">1.4.6 <i>Virtualbox и Vagrant?</i></a></li>
<li><a href="#sec-1-4-7">1.4.7 <i>LaTeX?</i></a></li>
<li><a href="#sec-1-4-8">1.4.8 <i>Emacs?</i></a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 Схема взаимодействия модулей системы</a></li>
<li><a href="#sec-1-6">1.6 Логическая модель данных</a></li>
<li><a href="#sec-1-7">1.7 Алгоритм вычисления очков умений</a></li>
<li><a href="#sec-1-8">1.8 Редактор персонажей</a></li>
<li><a href="#sec-1-9">1.9 Тестирование</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-1">
<h1 id="sec-1"><span class="section-number-1">1</span> План доклада</h1>
<div class="outline-text-1" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-2">
<h2 id="sec-1-1"><span class="section-number-2">1.1</span> <span class="done DONE">DONE</span> Титульник</h2>
<div class="outline-text-2" id="text-1-1">

<p>   Зачитать название темы
</p></div>

</div>

<div id="outline-container-1-2" class="outline-2">
<h2 id="sec-1-2"><span class="section-number-2">1.2</span> <span class="todo TODO">TODO</span> Исходная информационная система</h2>
<div class="outline-text-2" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-3">
<h3 id="sec-1-2-1"><span class="section-number-3">1.2.1</span> Про то как это происходит</h3>
<div class="outline-text-3" id="text-1-2-1">

</div>

</div>

<div id="outline-container-1-2-2" class="outline-3">
<h3 id="sec-1-2-2"><span class="section-number-3">1.2.2</span> Ролевая и математическая составляющие</h3>
<div class="outline-text-3" id="text-1-2-2">

</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-2">
<h2 id="sec-1-3"><span class="section-number-2">1.3</span> <span class="todo TODO">TODO</span> Цели и задачи</h2>
<div class="outline-text-2" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-3">
<h3 id="sec-1-3-1"><span class="section-number-3">1.3.1</span> Цели</h3>
<div class="outline-text-3" id="text-1-3-1">

</div>

</div>

<div id="outline-container-1-3-2" class="outline-3">
<h3 id="sec-1-3-2"><span class="section-number-3">1.3.2</span> Задачи</h3>
<div class="outline-text-3" id="text-1-3-2">

</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-2">
<h2 id="sec-1-4"><span class="section-number-2">1.4</span> <span class="todo TODO">TODO</span> Используемые технологии</h2>
<div class="outline-text-2" id="text-1-4">

<p>   <b>ВАЖНО</b> Технологии были <i>выбраны</i> в соответствии с требованиями.
</p>
</div>

<div id="outline-container-1-4-1" class="outline-3">
<h3 id="sec-1-4-1"><span class="section-number-3">1.4.1</span> Ruby и Rails</h3>
<div class="outline-text-3" id="text-1-4-1">

<p>    Для разработки бекенда приложения были использованы ЯВУ Ruby и веб-фреймворк Ruby On Rails
</p></div>

</div>

<div id="outline-container-1-4-2" class="outline-3">
<h3 id="sec-1-4-2"><span class="section-number-3">1.4.2</span> Angular</h3>
<div class="outline-text-3" id="text-1-4-2">

<p>    Для разработки интерактивного редактора персонажей был использован javascript-фреймворк Angular, так как он позволяет быстро и просто создавать интерактивные страницы.
</p></div>

</div>

<div id="outline-container-1-4-3" class="outline-3">
<h3 id="sec-1-4-3"><span class="section-number-3">1.4.3</span> Postgresql</h3>
<div class="outline-text-3" id="text-1-4-3">

<p>    В качестве СУБД данных была выбрана СУБД PostgreSQL
</p></div>

</div>

<div id="outline-container-1-4-4" class="outline-3">
<h3 id="sec-1-4-4"><span class="section-number-3">1.4.4</span> Gnu/Linux</h3>
<div class="outline-text-3" id="text-1-4-4">

<p>    Ну тут без комментариев
</p></div>

</div>

<div id="outline-container-1-4-5" class="outline-3">
<h3 id="sec-1-4-5"><span class="section-number-3">1.4.5</span> Git и Bitbucket</h3>
<div class="outline-text-3" id="text-1-4-5">

<p>    Про контроль версий
</p></div>

</div>

<div id="outline-container-1-4-6" class="outline-3">
<h3 id="sec-1-4-6"><span class="section-number-3">1.4.6</span> <i>Virtualbox и Vagrant?</i></h3>
<div class="outline-text-3" id="text-1-4-6">

</div>

</div>

<div id="outline-container-1-4-7" class="outline-3">
<h3 id="sec-1-4-7"><span class="section-number-3">1.4.7</span> <i>LaTeX?</i></h3>
<div class="outline-text-3" id="text-1-4-7">

</div>

</div>

<div id="outline-container-1-4-8" class="outline-3">
<h3 id="sec-1-4-8"><span class="section-number-3">1.4.8</span> <i>Emacs?</i></h3>
<div class="outline-text-3" id="text-1-4-8">

</div>
</div>

</div>

<div id="outline-container-1-5" class="outline-2">
<h2 id="sec-1-5"><span class="section-number-2">1.5</span> <span class="todo TODO">TODO</span> Схема взаимодействия модулей системы</h2>
<div class="outline-text-2" id="text-1-5">

</div>

</div>

<div id="outline-container-1-6" class="outline-2">
<h2 id="sec-1-6"><span class="section-number-2">1.6</span> <span class="todo TODO">TODO</span> Логическая модель данных</h2>
<div class="outline-text-2" id="text-1-6">

</div>

</div>

<div id="outline-container-1-7" class="outline-2">
<h2 id="sec-1-7"><span class="section-number-2">1.7</span> <span class="todo TODO">TODO</span> Алгоритм вычисления очков умений</h2>
<div class="outline-text-2" id="text-1-7">

<p>   <b>ВАЖНО</b> алгоритм <b>НЕ ТРИВИАЛЬНЫЙ!</b>
</p></div>

</div>

<div id="outline-container-1-8" class="outline-2">
<h2 id="sec-1-8"><span class="section-number-2">1.8</span> <span class="todo TODO">TODO</span> Редактор персонажей</h2>
<div class="outline-text-2" id="text-1-8">

</div>

</div>

<div id="outline-container-1-9" class="outline-2">
<h2 id="sec-1-9"><span class="section-number-2">1.9</span> <span class="done DONE">DONE</span> Тестирование</h2>
<div class="outline-text-2" id="text-1-9">

<p>   Просто про тестирование
</p>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-06-03T14:04+0400</p>
<p class="author">Author: Emperor</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
